Revit 2024 API
ModelText.HorizontalAlignment Property
The horizontal alignment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public HorizontalAlign HorizontalAlignment { get; set; }
Visual Basic
Public Property HorizontalAlignment As HorizontalAlign
	Get
	Set
Visual C++
public:
property HorizontalAlign HorizontalAlignment {
	HorizontalAlign get ();
	void set (HorizontalAlign value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when an invalid value is assigned to the property.
See Also
ModelText Class
Autodesk.Revit.DB Namespace